Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_uart.h
#define    UART_ISR_TXBE_Pos                                      (1U)
#define    UART_ISR_TXBE_Msk                                      (0x1U << UART_ISR_TXBE_Pos)
#define    UART_ISR_TXBE                                          UART_ISR_TXBE_Msk

#define    UART_ISR_TXSE_Pos                                      (0U)
#define    UART_ISR_TXSE_Msk                                      (0x1U << UART_ISR_TXSE_Pos)
#define    UART_ISR_TXSE                                          UART_ISR_TXSE_Msk

#define    UART_TODR_TXDLY_LEN_Pos                                (8U)
#define    UART_TODR_TXDLY_LEN_Msk                                (0xffU << UART_TODR_TXDLY_LEN_Pos)
#define    UART_TODR_TXDLY_LEN                                    UART_TODR_TXDLY_LEN_Msk

#define    UART_TODR_RXTO_LEN_Pos                                 (0U)
#define    UART_TODR_RXTO_LEN_Msk                                 (0xffU << UART_TODR_RXTO_LEN_Pos)
#define    UART_TODR_RXTO_LEN                                     UART_TODR_RXTO_LEN_Msk

#define    UART_FFCR_SFREN_Pos                                    (11U)
#define    UART_FFCR_SFREN_Msk                                    (0x1U << UART_FFCR_SFREN_Pos)
#define    UART_FFCR_SFREN                                        UART_FFCR_SFREN_Msk

#define    UART_FFCR_ERSW_Pos                                     (9U)
#define    UART_FFCR_ERSW_Msk                                     (0x3U << UART_FFCR_ERSW_Pos)
#define    UART_FFCR_ERSW                                         UART_FFCR_ERSW_Msk

#define    UART_FFCR_ERSGD_Pos                                    (8U)
#define    UART_FFCR_ERSGD_Msk                                    (0x1U << UART_FFCR_ERSGD_Pos)
#define    UART_FFCR_ERSGD                                        UART_FFCR_ERSGD_Msk

#define    UART_FFCR_BGTEN_Pos                                    (7U)
#define    UART_FFCR_BGTEN_Msk                                    (0x1U << UART_FFCR_BGTEN_Pos)
#define    UART_FFCR_BGTEN                                        UART_FFCR_BGTEN_Msk

#define    UART_FFCR_REP_T_Pos                                    (6U)
#define    UART_FFCR_REP_T_Msk                                    (0x1U << UART_FFCR_REP_T_Pos)
#define    UART_FFCR_REP_T                                        UART_FFCR_REP_T_Msk

#define    UART_FFCR_PAR_Pos                                      (4U)
#define    UART_FFCR_PAR_Msk                                      (0x3U << UART_FFCR_PAR_Pos)
#define    UART_FFCR_PAR                                          UART_FFCR_PAR_Msk

#define    UART_FFCR_FREN_Pos                                     (3U)
#define    UART_FFCR_FREN_Msk                                     (0x1U << UART_FFCR_FREN_Pos)
#define    UART_FFCR_FREN                                         UART_FFCR_FREN_Msk

#define    UART_FFCR_TREPEN_Pos                                   (2U)
#define    UART_FFCR_TREPEN_Msk                                   (0x1U << UART_FFCR_TREPEN_Pos)
#define    UART_FFCR_TREPEN                                       UART_FFCR_TREPEN_Msk

#define    UART_FFCR_RREPEN_Pos                                   (1U)
#define    UART_FFCR_RREPEN_Msk                                   (0x1U << UART_FFCR_RREPEN_Pos)
#define    UART_FFCR_RREPEN                                       UART_FFCR_RREPEN_Msk

#define    UART_FFCR_DICONV_Pos                                   (0U)
#define    UART_FFCR_DICONV_Msk                                   (0x1U << UART_FFCR_DICONV_Pos)
#define    UART_FFCR_DICONV                                       UART_FFCR_DICONV_Msk

#define    UART_SCIER_TXSEIE_Pos                                  (3U)
#define    UART_SCIER_TXSEIE_Msk                                  (0x1U << UART_SCIER_TXSEIE_Pos)
#define    UART_SCIER_TXSEIE                                      UART_SCIER_TXSEIE_Msk

#define    UART_SCIER_RXIE_Pos                                    (2U)
#define    UART_SCIER_RXIE_Msk                                    (0x1U << UART_SCIER_RXIE_Pos)
#define    UART_SCIER_RXIE                                        UART_SCIER_RXIE_Msk

#define    UART_SCIER_TXIE_Pos                                    (1U)
#define    UART_SCIER_TXIE_Msk                                    (0x1U << UART_SCIER_TXIE_Pos)
#define    UART_SCIER_TXIE                                        UART_SCIER_TXIE_Msk

#define    UART_SCIER_LSIE_Pos                                    (0U)
#define    UART_SCIER_LSIE_Msk                                    (0x1U << UART_SCIER_LSIE_Pos)
#define    UART_SCIER_LSIE                                        UART_SCIER_LSIE_Msk

#define    UART_SCISR_WAIT_RPT_Pos                                (18U)
#define    UART_SCISR_WAIT_RPT_Msk                                (0x1U << UART_SCISR_WAIT_RPT_Pos)
#define    UART_SCISR_WAIT_RPT                                    UART_SCISR_WAIT_RPT_Msk

#define    UART_SCISR_TXBUSY_Pos                                  (17U)
#define    UART_SCISR_TXBUSY_Msk                                  (0x1U << UART_SCISR_TXBUSY_Pos)
#define    UART_SCISR_TXBUSY                                      UART_SCISR_TXBUSY_Msk

#define    UART_SCISR_RXBUSY_Pos                                  (16U)
#define    UART_SCISR_RXBUSY_Msk                                  (0x1U << UART_SCISR_RXBUSY_Pos)
#define    UART_SCISR_RXBUSY                                      UART_SCISR_RXBUSY_Msk

#define    UART_SCISR_TPARERR_Pos                                 (11U)
#define    UART_SCISR_TPARERR_Msk                                 (0x1U << UART_SCISR_TPARERR_Pos)
#define    UART_SCISR_TPARERR                                     UART_SCISR_TPARERR_Msk

#define    UART_SCISR_RPARERR_Pos                                 (10U)
#define    UART_SCISR_RPARERR_Msk                                 (0x1U << UART_SCISR_RPARERR_Pos)
#define    UART_SCISR_RPARERR                                     UART_SCISR_RPARERR_Msk

#define    UART_SCISR_FRERR_Pos                                   (9U)
#define    UART_SCISR_FRERR_Msk                                   (0x1U << UART_SCISR_FRERR_Pos)
#define    UART_SCISR_FRERR                                       UART_SCISR_FRERR_Msk

#define    UART_SCISR_OVERR_Pos                                   (8U)
#define    UART_SCISR_OVERR_Msk                                   (0x1U << UART_SCISR_OVERR_Pos)
#define    UART_SCISR_OVERR                                       UART_SCISR_OVERR_Msk

#define    UART_SCISR_TXSE_Pos                                    (3U)
#define    UART_SCISR_TXSE_Msk                                    (0x1U << UART_SCISR_TXSE_Pos)
#define    UART_SCISR_TXSE                                        UART_SCISR_TXSE_Msk

#define    UART_SCISR_RXIF_Pos                                    (2U)
#define    UART_SCISR_RXIF_Msk                                    (0x1U << UART_SCISR_RXIF_Pos)
#define    UART_SCISR_RXIF                                        UART_SCISR_RXIF_Msk

#define    UART_SCISR_TXIF_Pos                                    (1U)
#define    UART_SCISR_TXIF_Msk                                    (0x1U << UART_SCISR_TXIF_Pos)
#define    UART_SCISR_TXIF                                        UART_SCISR_TXIF_Msk

#define    UART_SCISR_ERRIF_Pos                                   (0U)
#define    UART_SCISR_ERRIF_Msk                                   (0x1U << UART_SCISR_ERRIF_Pos)
#define    UART_SCISR_ERRIF                                       UART_SCISR_ERRIF_Msk






